## Step1 : Connect to local database where Pagila is loaded

In [1]:
%load_ext sql

In [2]:
# connection
conn_string = "postgresql://postgres:707707@localhost:5432/pagila"
print(conn_string)

postgresql://postgres:707707@localhost:5432/pagila

In [3]:
%sql $conn_string

In [4]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;




print("nStores\t\t=", nStores[0][0])
print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nCity\t\t=", nCity[0][0])
print("nCountry\t=", nCountry[0][0])

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
nStores		= 2
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 16049
nStaff		= 2
nCity		= 600
nCountry	= 109

## When? What time period are we talking about?

In [5]:
%%sql
select min(rental_date) as start, max(rental_date) as end from rental;

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.

[(datetime.datetime(2005, 5, 24, 22, 53, 30), datetime.datetime(2006, 2, 14, 15, 16, 3))]

## Where ? Where do events in this database occur?

In [6]:
%%sql
select district, count(1) as Count
from address
group by district
order by Count desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('Buenos Aires', 10),
 ('Shandong', 9),
 ('California', 9),
 ('West Bengali', 9),
 ('Uttar Pradesh', 8),
 ('So Paulo', 8),
 ('England', 7),
 ('Maharashtra', 7),
 ('Southern Tagalog', 6),
 ('Gois', 5)]

## Step3: Perform some simple Data Analysis

## 3.1.1 Films

In [7]:
%%sql
select film_id, title, release_year, rental_rate, rating from film limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

## 3.1.2 Payments

In [8]:
%%sql
select * from payment limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2007, 1, 24, 21, 40, 19, 996577)),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2007, 1, 25, 15, 16, 50, 996577)),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2007, 1, 28, 21, 44, 14, 996577)),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2007, 1, 29, 0, 58, 2, 996577)),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2007, 1, 29, 8, 10, 6, 996577))]

## 3.1.3 Inventory

In [10]:
%%sql
select * from inventory limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (3, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (4, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (5, 1, 2, datetime.datetime(2006, 2, 15, 10, 9, 17))]

## 3.1.4 Get the movie of every Payment

In [11]:
%%sql
Select f.title, p.amount, p.payment_date, p.customer_id
from film f
JOIN inventory i ON (f.film_id = i.film_id)
JOIN rental r ON ( r.inventory_id = i.inventory_id)
JOIN payment p ON (p.rental_id = r.rental_id)
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[('SWARM GOLD', Decimal('1.99'), datetime.datetime(2007, 1, 24, 21, 40, 19, 996577), 269),
 ('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2007, 1, 25, 15, 16, 50, 996577), 269),
 ('SOMETHING DUCK', Decimal('6.99'), datetime.datetime(2007, 1, 28, 21, 44, 14, 996577), 269),
 ('DRACULA CRYSTAL', Decimal('0.99'), datetime.datetime(2007, 1, 29, 0, 58, 2, 996577), 269),
 ('CLOSER BANG', Decimal('4.99'), datetime.datetime(2007, 1, 29, 8, 10, 6, 996577), 269)]

## 3.1.5 sum movie rental revenue

In [12]:
%%sql
Select f.title, sum(p.amount) as revenue
from film f
JOIN inventory i ON (f.film_id = i.film_id)
JOIN rental r ON ( r.inventory_id = i.inventory_id)
JOIN payment p ON (p.rental_id = r.rental_id)
GROUP BY title
ORDER BY revenue desc
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72'))]